vinylstars-master/app/views/albums/_form.html.erb

      <div class="col-lg-10">
        <%= f.select :artist_id, Artist.all.sort_by{|a| a.name}.collect { |a| [a.name, a.id] }, {prompt: "Please select", :class => 'form-control'} %>
---
SELECT "artists".* FROM "artists"

      <div class="col-lg-10">
        <%= f.select :category_ids, Category.all.sort_by{|a| a.title}.collect { |a| [a.title, a.id] }, {multiple: false, prompt: "Please select", :class => 'form-control'} %>
---
SELECT "categories".* FROM "categories"

      <div class="col-lg-10">
        <%= f.select :condition_id, Condition.all.collect { |c| [c.name, c.id] }, {prompt: 'Please select', :class => 'form-control'} %>
---
SELECT "conditions".* FROM "conditions"