app/controllers/artists_controller.rb

  def index
    @search = Artist.ransack(params[:q])
    @artists = @search.result(distinct: true)
                      .includes(:albums)
                      .joins(:albums)
                      .page(params[:page])
---
SELECT  DISTINCT "artists"."id" FROM "artists" INNER JOIN "albums" ON "albums"."artist_id" = "artists"."id" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]

  def show
    @search = Album.ransack(params[:q])
    @albums = @search.result(distinct: true).page(params[:page])
---
SELECT  DISTINCT "albums".* FROM "albums" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Queen"], ["created_at", "2020-07-02 20:39:52.718829"], ["updated_at", "2020-07-02 20:39:52.718829"]]