app/controllers/categories_controller.rb

SELECT  DISTINCT "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @search = Category.ransack(params[:q])
    @categories = @search.result(distinct: true).page(params[:page])

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Rock"], ["created_at", "2020-07-02 20:39:38.404729"], ["updated_at", "2020-07-02 20:39:38.404729"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save