app/controllers/conditions_controller.rb

  def index
    @search = Condition.ransack(params[:q])
    @conditions = @search.result(distinct: true).page(params[:page])
---
SELECT  DISTINCT "conditions".* FROM "conditions" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]

  def create
    @condition = Condition.new(condition_params)

    respond_to do |format|
      if @condition.save
---
INSERT INTO "conditions" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Used"], ["created_at", "2020-07-02 20:39:18.258691"], ["updated_at", "2020-07-02 20:39:18.258691"]]

    def set_condition
      @condition = Condition.find(params[:id])
---
SELECT  "conditions".* FROM "conditions" WHERE "conditions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]