vinylstars-master/app/controllers/albums_controller.rb

  def index
    @search = Album.ransack(params[:q])
    @albums = @search.result(distinct: true).page(params[:page])
---
SELECT  DISTINCT "albums".* FROM "albums" ORDER BY "albums"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]

  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("artist_id", "title", "year", "created_at", "updated_at", "condition_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["artist_id", 1], ["title", "A Fever You Can't Sweat Out"], ["year", "2005"], ["created_at", "2020-09-24 02:52:37.171032"], ["updated_at", "2020-09-24 02:52:37.171032"], ["condition_id", 1]]

  def update
    respond_to do |format|
      if @album.update(album_params)
---
UPDATE "albums" SET "thumbnail" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["thumbnail", "fever_you_cant_sweat_out.jpg"], ["updated_at", "2020-09-24 03:11:16.445866"], ["id", 1]]