vinylstars-master/app/controllers/artists_controller.rb

SELECT  DISTINCT "artists".* FROM "artists" ORDER BY "artists"."created_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @search = Artist.ransack(params[:q])
    @artists = @search.result(distinct: true).page(params[:page])

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Queen"], ["created_at", "2020-07-02 20:39:52.718829"], ["updated_at", "2020-07-02 20:39:52.718829"]]
---
  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save